Repository: Star-Lord-XIII/project-euphonia-app
Catalog: lib/l10n/app_*.arb
Languages: it

# transcribeModeTitle
source: Transcribe
it: Trascrivi

# recordButtonTitle
source: Record
it: Registra

# reRecordButtonTitle
source: Re-record
it: Registra nuovamente

# stopRecordingButtonTitle
source: Stop Recording
it: Termina registrazione

# transcribeButtonTitle
source: Transcribe
it: Trascrivi

# stopTranscribingButtonTitle
source: Stop
it: Ferma

# settingsMenuDrawerTitle
source: Settings
it: Impostazioni

# saveButtonTitle
source: Save
it: Salva

# valueSavedMessage
source: Value saved
it: Parametro salvato

# cloudRunTextFieldLabel
source: URL of cloud-run service
it: URL del servizio Cloud Run

# addTranscriptionEndpointPrompt
source: Please add a URL before transcribing
it: Aggiungi uan URL nelle impostazioni per iniziare la trascrizione.

# transcriptionEndpointDisplay
source: Using endpoint "{transcriptionURL}" to transcribe
it: L'indirizzo "{transcriptionURL}/transcribe" Ã¨ utilizzato per la trascrizione

source: Previous phrase button
it: Frase precedente

source: Play phrase button
it: Riproduci frase

source: Next phrase button
it: Frase successiva

# previousPhraseButtonHint
source: Double tap to jump to previous phrase
it: Tocca due volte per passare alla frase precedente

# playPhraseButtonHint
source: Double tap to play phrase recording
it: Tocca due volte per riprodurre la registrazione

# nextPhraseButtonHint
source: Double tap to jump to next phrase
it: Tocca due volte per passare alla frase successiva

# autoAdvanceSettingTitle
source: Auto advance
it: Avanzamento automatico

# autoAdvanceSettingSubtitle
source: Move to next phrase automatically after you finish recording the current phrase
it: Passa alla frase successiva automaticamente dopo aver terminato la registrazione della frase corrente
